#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"]: Refreshing state... [id=E3R7ITY1ZA9AK3]
data.aws_route53_zone.selected: Reading...
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:004351562122:certificate/b6bdd797-3f80-4874-8846-d26f8436eeae]
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]
aws_s3_bucket.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_s3_bucket.logs: Refreshing state... [id=aheadinthecloud-logs-us-east-1-004351562122-prod]
data.aws_route53_zone.selected: Read complete after 1s [id=Z08846413OJRCH3MJOFHV]
aws_route53_record.acm["*.aheadinthecloud.com"]: Refreshing state... [id=Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME]
aws_acm_certificate_validation.this: Refreshing state... [id=2023-07-12 15:57:31.442 +0000 UTC]
aws_s3_bucket_ownership_controls.logs: Refreshing state... [id=aheadinthecloud-logs-us-east-1-004351562122-prod]
aws_s3_bucket_logging.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E3AB5V8CH4QET7]
aws_route53_record.domain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_aheadinthecloud.com_A]
module.cloudfront.aws_cloudfront_monitoring_subscription.this[0]: Refreshing state... [id=E3AB5V8CH4QET7]
data.aws_iam_policy_document.oac_policy: Reading...
data.aws_iam_policy_document.oac_policy: Read complete after 0s [id=245180501]
aws_route53_record.subdomain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_www.aheadinthecloud.com_A]
aws_s3_bucket_policy.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.this must be replaced
+/- resource "aws_acm_certificate" "this" {
      ~ arn                       = "arn:aws:acm:us-east-1:004351562122:certificate/b6bdd797-3f80-4874-8846-d26f8436eeae" -> (known after apply)
      ~ domain_name               = "*.aheadinthecloud.com" -> "aheadinthecloud.com" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.aheadinthecloud.com"
              - resource_record_name  = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6f9e120e77ada084af4c5a19c6ac73c4.vrcmzfbvtx.acm-validations.aws."
            },
          + {
              + domain_name           = "*.aheadinthecloud.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "aheadinthecloud.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:004351562122:certificate/b6bdd797-3f80-4874-8846-d26f8436eeae" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2024-08-09T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-07-12T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "aheadinthecloud.com",
            # (1 unchanged element hidden)
        ]
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (1 unchanged attribute hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.this must be replaced
-/+ resource "aws_acm_certificate_validation" "this" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:004351562122:certificate/b6bdd797-3f80-4874-8846-d26f8436eeae" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "2023-07-12 15:57:31.442 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com",
        ] -> (known after apply) # forces replacement
    }

  # aws_route53_record.acm["*.aheadinthecloud.com"] must be replaced
-/+ resource "aws_route53_record" "acm" {
      ~ fqdn                             = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com" -> (known after apply)
      ~ id                               = "Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com" # forces replacement -> (known after apply) # forces replacement
      ~ records                          = [
          - "_6f9e120e77ada084af4c5a19c6ac73c4.vrcmzfbvtx.acm-validations.aws.",
        ] -> (known after apply)
      ~ type                             = "CNAME" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_route53_record.acm["aheadinthecloud.com"] will be created
  + resource "aws_route53_record" "acm" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08846413OJRCH3MJOFHV"
    }

  # module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                        = [
          + "aheadinthecloud.com",
            # (1 unchanged element hidden)
        ]
        id                             = "E3AB5V8CH4QET7"
        tags                           = {}
        # (18 unchanged attributes hidden)

      + custom_error_response {
          + error_code         = 404
          + response_code      = 404
          + response_page_path = "/404/index.html"
        }

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:004351562122:certificate/b6bdd797-3f80-4874-8846-d26f8436eeae" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*